/*
 * Name: OgreTextFinderLocalizable.strings
 * Project: OgreKit
 *
 * Creation Date: Jan 22 2004
 * Author: Isao Sonobe <sonoisa (AT) muse (DOT) ocn (DOT) ne (DOT) jp>
 * Copyright: Copyright (c) 2004 Isao Sonobe, All rights reserved.
 * License: OgreKit License
 *
 * Encoding: UTF16
 * Tabsize: 4
 */

"Find"			= "Rechercher";	/* the title of the "Find" menu */
"Replace"		= "Remplacer";
"Find All"		= "Tout rechercher";
"Replace All"   = "Tout remplacer";
"Highlight"		= "Surlignage";

/* the titles of buttons */
"OK"		= "OK";
"Cancel"	= "Annuler";

/* progrss messages */
" (%dsec remaining)"        = " (encore %dsec)";    // sec: second
// Find All
"%d string found."          = "%d chaîne trouvée.";
"%d strings found."         = "%d chaînes trouvées.";
// Replace All
"%d string replaced."       = "%d chaîne remplacée.";
"%d strings replaced."      = "%d chaînes remplacées.";
// Highlight
"%d string highlighted."    = "%d chaîne surlignée.";
"%d strings highlighted."   = "%d chaînes surlignées.";

/* finish messages */
// not found
"Not found. (%.3fsec)"							= "Pas de correspondance. (%.3fsec)";
"Not found. (canceled, %.3fsec)"				= "Pas de correspondance. (annulé, %.3fsec)";
// Find All
"%d string found. (%.3fsec)"					= "%d chaîne trouvée. (%.3fsec)";
"%d strings found. (%.3fsec)"					= "%d chaînes trouvées. (%.3fsec)";
"%d string found. (canceled, %.3fsec)"			= "%d chaîne trouvée. (annulé, %.3fsec)";
"%d strings found. (canceled, %.3fsec)"			= "%d chaînes trouvées. (annulé, %.3fsec)";
// Replace All
"%d string replaced. (%.3fsec)"					= "%d chaîne remplacée. (%.3fsec)";
"%d strings replaced. (%.3fsec)"				= "%d chaînes remplacées. (%.3fsec)";
"%d string replaced. (canceled, %.3fsec)"		= "%d chaîne remplacée. (annulé, %.3fsec)";
"%d strings replaced. (canceled, %.3fsec)"		= "%d chaînes remplacées. (annulé, %.3fsec)";
// Highlight
"%d string highlighted. (%.3fsec)"				= "%d chaîne surlignée. (%.3fsec)";
"%d strings highlighted. (%.3fsec)"				= "%d chaînes surlignées. (%.3fsec)";
"%d string highlighted. (canceled, %.3fsec)"	= "%d chaîne surlignée. (annulé, %.3fsec)";
"%d strings highlighted. (canceled, %.3fsec)"   = "%d chaînes surlignées. (annulé, %.3fsec)";

/* error messages */
"Error! Uneditable."	= "Erreur! Non éditable."; /* a target TextView is not editable */
"Missing."				= "Absente.";			/* a found string became missing */

/* Find Result Window*/
"Find Result for \"%@\""        = "Résultat de la rechercher pour \"%@\"";
"%d string found."				= "%d chaîne trouvée.";
"%d strings found."				= "%d chaînes trouvées.";
"Found in %d item."				= "Trouvé dans %d élément.";
"Found in %d items."            = "Trouvé dans %d éléments.";
"Find String: %@"               = "Chercher la chaîne : %@";
"Line"                          = "Ligne";
"Found String"                  = "Chaîne trouvée";
"Live Update"                   = "Live Update";
"Selected string not found."	= "La chaîne sélectionnée n'a pas été trouvée."; /* error message */

/* preparation */
"Favorites"					= "Signets";
"Custom Find/Replace"		= "Rechercher/Remplacer personnalisé";
"Definition"				= "Définition";
"Serial (Pipe)"				= "Série (Pipe)";
"Parallel (Join)"			= "Parallèle (Join)";
"Multifile Find/Replace"	= "Rechercher/Remplacer multifichiés";
